<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="y" type="Parameter" version="opset1">
			<data shape="?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="y">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="14" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="14" />
			</output>
		</layer>
		<layer id="2" name="aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="15,input.1">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="aten::pad/Concat" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="8" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="aten::pad/ConvertLike_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="20" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="5" name="aten::pad/ConvertLike" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="6" name="aten::pad/Pad" type="Pad" version="opset1">
			<data pad_mode="reflect" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="21,y_1">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="22" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="22" />
			</output>
		</layer>
		<layer id="8" name="aten::squeeze/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="23,input">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="aten::to/Convert_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024" offset="22" size="2048" />
			<output>
				<port id="0" precision="FP16" names="13,window">
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="24" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2070" size="8" />
			<output>
				<port id="0" precision="I64" names="24" />
			</output>
		</layer>
		<layer id="12" name="25" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2078" size="8" />
			<output>
				<port id="0" precision="I64" names="25" />
			</output>
		</layer>
		<layer id="13" name="aten::stft/STFT" type="STFT" version="opset15">
			<data transpose_frames="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
				</port>
				<port id="2" precision="I64" />
				<port id="3" precision="I64" />
			</input>
			<output>
				<port id="4" precision="FP32" names="31,spec">
					<dim>-1</dim>
					<dim>513</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_2010_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="2086" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_2010" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>513</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="33">
					<dim>-1</dim>
					<dim>513</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_83" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2088" size="8" />
			<output>
				<port id="0" precision="I64" names="35">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="aten::sum/ReduceSum" type="ReduceSum" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>513</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="38">
					<dim>-1</dim>
					<dim>513</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_2011_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="2096" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_2011" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>513</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="41">
					<dim>-1</dim>
					<dim>513</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="aten::sqrt/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>513</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>513</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Result_102" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>513</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="6" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="3" from-port="0" to-layer="6" to-port="2" />
		<edge from-layer="4" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="3" />
		<edge from-layer="6" from-port="4" to-layer="8" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="9" from-port="0" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="13" to-port="1" />
		<edge from-layer="11" from-port="0" to-layer="13" to-port="2" />
		<edge from-layer="12" from-port="0" to-layer="13" to-port="3" />
		<edge from-layer="13" from-port="4" to-layer="16" to-port="0" />
		<edge from-layer="14" from-port="0" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="16" to-port="1" />
		<edge from-layer="16" from-port="2" to-layer="18" to-port="0" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="1" />
		<edge from-layer="18" from-port="2" to-layer="21" to-port="0" />
		<edge from-layer="19" from-port="0" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="21" to-port="1" />
		<edge from-layer="21" from-port="2" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="1" to-layer="23" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2025.1.0-18503-6fec06580ab-releases/2025/1" />
		<conversion_parameters>
			<framework value="pytorch" />
			<is_python_object value="True" />
		</conversion_parameters>
	</rt_info>
</net>
